# #!/usr/bin/env python
# # -*- coding:utf-8 -*-
# mysql> select * from book;
# +----+-----------------+--------+--------------------------------+-------+--------------+
# | id | book_name       | author | publisher                      | price | publish_date |
# +----+-----------------+--------+--------------------------------+-------+--------------+
# |  1 | 倚天屠龙记      | egon   | 北京工业地雷出版社             | 70.00 | 2019-07-01   |
# |  2 | 九阳神功        | alex   | 人民音乐不好听出版社           |  5.00 | 2018-07-04   |
# |  3 | 九阴真经        | yuan   | 北京工业地雷出版社             | 62.00 | 2017-07-12   |
# |  4 | 九阴白骨爪      | jin    | 人民音乐不好听出版社           | 40.00 | 2019-08-07   |
# |  5 | 独孤九剑        | alex   | 北京工业地雷出版社             | 12.00 | 2017-09-01   |
# |  6 | 降龙十巴掌      | egon   | 知识产权没有用出版社           | 20.00 | 2019-07-05   |
# |  7 | 葵花宝典        | yuan   | 知识产权没有用出版社           | 33.00 | 2019-08-02   |
# +----+-----------------+--------+--------------------------------+-------+--------------+
# 7 rows in set (0.00 sec)
# """
# 1.查询egon写的所有书和价格
# """
# mysql> select author, book_name, price from book where author='egon';
# +--------+-----------------+-------+
# | author | book_name       | price |
# +--------+-----------------+-------+
# | egon   | 倚天屠龙记      | 70.00 |
# | egon   | 降龙十巴掌      | 20.00 |
# +--------+-----------------+-------+
# 2 rows in set (0.00 sec)
#
# """
# 2.找出最贵的图书的价格
# """
# mysql> select max(price) from book  ;
# +------------+
# | max(price) |
# +------------+
# |      70.00 |
# +------------+
# 1 row in set (0.00 sec)
#
# """
# 3.求所有图书的均价
# """
# mysql> select avg(price) from book;
# +------------+
# | avg(price) |
# +------------+
# |  34.571429 |
# +------------+
# 1 row in set (0.00 sec)
#
# """
# 4.将所有图书按照出版日期排序
# """
# mysql> select * from book order by publish_date asc;
# +----+-----------------+--------+--------------------------------+-------+--------------+
# | id | book_name       | author | publisher                      | price | publish_date |
# +----+-----------------+--------+--------------------------------+-------+--------------+
# |  3 | 九阴真经        | yuan   | 北京工业地雷出版社             | 62.00 | 2017-07-12   |
# |  5 | 独孤九剑        | alex   | 北京工业地雷出版社             | 12.00 | 2017-09-01   |
# |  2 | 九阳神功        | alex   | 人民音乐不好听出版社           |  5.00 | 2018-07-04   |
# |  1 | 倚天屠龙记      | egon   | 北京工业地雷出版社             | 70.00 | 2019-07-01   |
# |  6 | 降龙十巴掌      | egon   | 知识产权没有用出版社           | 20.00 | 2019-07-05   |
# |  7 | 葵花宝典        | yuan   | 知识产权没有用出版社           | 33.00 | 2019-08-02   |
# |  4 | 九阴白骨爪      | jin    | 人民音乐不好听出版社           | 40.00 | 2019-08-07   |
# +----+-----------------+--------+--------------------------------+-------+--------------+
# 7 rows in set (0.00 sec)
#
#
# """
# 5.查询alex写的所有书的平均价格
# """
# mysql> select avg(price) from book where author='egon';
# +------------+
# | avg(price) |
# +------------+
# |  45.000000 |
# +------------+
# 1 row in set (0.00 sec)
#
#
# """
# 6.查询人民音乐不好听出版社出版的所有图书
# """
# mysql> select * from book where publisher = '人民音乐不好听出版社';
# +----+-----------------+--------+--------------------------------+-------+--------------+
# | id | book_name       | author | publisher                      | price | publish_date |
# +----+-----------------+--------+--------------------------------+-------+--------------+
# |  2 | 九阳神功        | alex   | 人民音乐不好听出版社           |  5.00 | 2018-07-04   |
# |  4 | 九阴白骨爪      | jin    | 人民音乐不好听出版社           | 40.00 | 2019-08-07   |
# +----+-----------------+--------+--------------------------------+-------+--------------+
# 2 rows in set (0.00 sec)
#
#
# """
# 7.查询人民音乐出版社出版的alex写的所有图书和价格
# """
# mysql> select * from book where publisher = '人民音乐不好听出版社' and author = 'alex';
# +----+--------------+--------+--------------------------------+-------+--------------+
# | id | book_name    | author | publisher                      | price | publish_date |
# +----+--------------+--------+--------------------------------+-------+--------------+
# |  2 | 九阳神功     | alex   | 人民音乐不好听出版社           |  5.00 | 2018-07-04   |
# +----+--------------+--------+--------------------------------+-------+--------------+
# 1 row in set (0.00 sec)
#
# """
# 8.找出出版图书均价最高的作者
# """
# mysql> select author,avg(price) from book group by author order by avg(price) desc limit 1;
# +--------+------------+
# | author | avg(price) |
# +--------+------------+
# | yuan   |  47.500000 |
# +--------+------------+
# 1 row in set (0.01 sec)
#
# """
# 9.找出最新出版的图书的作者和出版社
# """
# mysql> select author, publisher from book order by publish_date desc limit 1;
# +--------+--------------------------------+
# | author | publisher                      |
# +--------+--------------------------------+
# | jin    | 人民音乐不好听出版社           |
# +--------+--------------------------------+
# 1 row in set (0.00 sec)
#
#
# """
# 10.显示各出版社出版的所有图书
# """
# mysql> select book_name, publisher from book where publisher in ('北京工业地雷出版社', '人民音乐不好听出版社', '北京工业地雷出版社','知识产权没有用出版社') order by publisher;
# +-----------------+--------------------------------+
# | book_name       | publisher                      |
# +-----------------+--------------------------------+
# | 九阳神功        | 人民音乐不好听出版社           |
# | 九阴白骨爪      | 人民音乐不好听出版社           |
# | 倚天屠龙记      | 北京工业地雷出版社             |
# | 九阴真经        | 北京工业地雷出版社             |
# | 独孤九剑        | 北京工业地雷出版社             |
# | 降龙十巴掌      | 知识产权没有用出版社           |
# | 葵花宝典        | 知识产权没有用出版社           |
# +-----------------+--------------------------------+
# 7 rows in set (0.00 sec)
#
# """
# 11.查找价格最高的图书，并将它的价格修改为50元
# """
# mysql> update book set price = 50 where price = 70;
# Query OK, 1 row affected (0.00 sec)
# Rows matched: 1  Changed: 1  Warnings: 0
#
# mysql> select * from book;
# +----+-----------------+--------+--------------------------------+-------+--------------+
# | id | book_name       | author | publisher                      | price | publish_date |
# +----+-----------------+--------+--------------------------------+-------+--------------+
# |  1 | 倚天屠龙记      | egon   | 北京工业地雷出版社             | 50.00 | 2019-07-01   |
# |  2 | alexsb          | alex   | 人民音乐不好听出版社           |  5.00 | 2018-07-04   |
# |  3 | 九阴真经        | yuan   | 北京工业地雷出版社             | 62.00 | 2017-07-12   |
# |  4 | 九阴白骨爪      | jin    | 人民音乐不好听出版社           | 40.00 | 2019-08-07   |
# |  5 | alexsb          | alex   | 北京工业地雷出版社             | 12.00 | 2017-09-01   |
# |  6 | 降龙十巴掌      | egon   | 知识产权没有用出版社           | 20.00 | 2019-07-05   |
# |  7 | 葵花宝典        | yuan   | 知识产权没有用出版社           | 33.00 | 2019-08-02   |
# +----+-----------------+--------+--------------------------------+-------+--------------+
# 7 rows in set (0.00 sec)
#
#
# """
# 12.删除价格最低的那本书对应的数据
# """
# mysql> select min(price) from book;
# +------------+
# | min(price) |
# +------------+
# |       5.00 |
# +------------+
# 1 row in set (0.00 sec)
# mysql> delete from book where price=5;
# Query OK, 1 row affected (0.00 sec)
#
# mysql> select * from book;
# +----+-----------------+--------+--------------------------------+-------+--------------+
# | id | book_name       | author | publisher                      | price | publish_date |
# +----+-----------------+--------+--------------------------------+-------+--------------+
# |  1 | 倚天屠龙记      | egon   | 北京工业地雷出版社             | 50.00 | 2019-07-01   |
# |  3 | 九阴真经        | yuan   | 北京工业地雷出版社             | 62.00 | 2017-07-12   |
# |  4 | 九阴白骨爪      | jin    | 人民音乐不好听出版社           | 40.00 | 2019-08-07   |
# |  5 | alexsb          | alex   | 北京工业地雷出版社             | 12.00 | 2017-09-01   |
# |  6 | 降龙十巴掌      | egon   | 知识产权没有用出版社           | 20.00 | 2019-07-05   |
# |  7 | 葵花宝典        | yuan   | 知识产权没有用出版社           | 33.00 | 2019-08-02   |
# +----+-----------------+--------+--------------------------------+-------+--------------+
# 6 rows in set (0.00 sec)
#
# """
# 13.将所有alex写的书修改成alexsb
# """
# mysql> update book set book_name='alexsb' where author = 'alex';
# Query OK, 2 rows affected (0.00 sec)
# Rows matched: 2  Changed: 2  Warnings: 0
#
# mysql> select * from book where author='alex';
# +----+-----------+--------+--------------------------------+-------+--------------+
# | id | book_name | author | publisher                      | price | publish_date |
# +----+-----------+--------+--------------------------------+-------+--------------+
# |  2 | alexsb    | alex   | 人民音乐不好听出版社           |  5.00 | 2018-07-04   |
# |  5 | alexsb    | alex   | 北京工业地雷出版社             | 12.00 | 2017-09-01   |
# +----+-----------+--------+--------------------------------+-------+--------------+
# 2 rows in set (0.00 sec)
#
#
# """
# 14.将所有2017年出版的图书从数据库中删除
# """
# mysql> delete from book where year(publish_date) = 2017;
# Query OK, 2 rows affected (0.00 sec)
#
# mysql> select * from book;
# +----+-----------------+--------+--------------------------------+-------+--------------+
# | id | book_name       | author | publisher                      | price | publish_date |
# +----+-----------------+--------+--------------------------------+-------+--------------+
# |  1 | 倚天屠龙记      | egon   | 北京工业地雷出版社             | 50.00 | 2019-07-01   |
# |  4 | 九阴白骨爪      | jin    | 人民音乐不好听出版社           | 40.00 | 2019-08-07   |
# |  6 | 降龙十巴掌      | egon   | 知识产权没有用出版社           | 20.00 | 2019-07-05   |
# |  7 | 葵花宝典        | yuan   | 知识产权没有用出版社           | 33.00 | 2019-08-02   |
# +----+-----------------+--------+--------------------------------+-------+--------------+
# 4 rows in set (0.00 sec)
#
